# Taps
tap "FelixKratz/formulae"

# Shell
brew "zsh"
brew "starship"

# Core development tools
brew "git"
brew "curl"
brew "wget"
brew "python@3.12"

# Containers
# `brew "docker"` is CLI only - needs a daemon (colima or Docker Desktop)
brew "docker"
brew "colima"   # Docker daemon - free, lightweight alternative to Docker Desktop
brew "podman"
brew "distrobox"

# Editors, terminal, desktop
brew "helix"
cask "ghostty"
cask "nikitabobko/tap/aerospace", args: { "with-trusted" => true }
cask "borders", args: { "with-trusted" => true }

# CLI utilities
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "jq"
brew "yq"
brew "direnv"
brew "gh"
brew "zellij"
brew "eza"			# Modern ls replacement with git integration
brew "jj"			# Jujutsu VCS - powerful git alternative

# Cyber & detection engineering
brew "nmap"
brew "socat"

# Dev utilities
brew "httpie"
brew "lazygit"
brew "tree"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Optional - uncomment as needed
# cask "burp-suite-community"
# cask "wireshark"
