# Core development and tooling
brew "git"
brew "curl"
brew "wget"
brew "python@3.12"

# Container & VM tooling
brew "docker"
brew "podman"
brew "distrobox"

# Editors & terminal
brew "helix"
brew "ghostty"
brew "hyprspace"
brew "aider-ai"

# CLI utilities & productivity
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "jq"
brew "yq"
brew "direnv"
brew "gh"  # GitHub CLI for Actions workflows

# Cyber & detection engineering tools
brew "nmap"
brew "socat"
brew "mitmproxy"

# Development utilities
brew "httpie"  # Better curl for APIs
brew "lazygit"  # Git UI in terminal (optional, useful for quick review)
brew "tree"
brew "tmux"    # Session management if needed

# Taps for additional tools
tap "homebrew/bundle"
tap "homebrew/cask"  # If you need GUI apps later

# Optional casks (GUI apps - uncomment as needed)
# cask "burp-suite-community"
# cask "wireshark"
# cask "visual-studio-code"
