# Shell
brew "zsh"
brew "starship"

# Core development tools
brew "git"
brew "curl"
brew "wget"
brew "python@3.12"

# Containers
# `brew "docker"` is CLI only - needs a daemon (colima or Docker Desktop)
brew "docker"
brew "colima"   # Docker daemon - free, lightweight alternative to Docker Desktop
brew "podman"
brew "distrobox"

# Taps
tap "BarutSRB/tap"
tap "azixxxxx/tap"

# Editors, terminal, desktop
brew "helix"
cask "ghostty"
brew "omniwm"
cask "glance"
brew "aider-ai"

# CLI utilities
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "jq"
brew "yq"
brew "direnv"
brew "gh"

# Cyber & detection engineering
brew "nmap"
brew "socat"
brew "mitmproxy"

# Dev utilities
brew "httpie"
brew "lazygit"
brew "tree"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Optional - uncomment as needed
# cask "burp-suite-community"
# cask "wireshark"
